gpu/rapidcfd/cases/vg12d110b10_a16/0/U
/*--------------------------------*- C++ -*----------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (36.0892 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (36.0892 0 0);
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (36.0892 0 0);
    }

    top
    {
        type            freestream;
        freestreamValue uniform (36.0892 0 0);
    }

    bottom
    {
        type            freestream;
        freestreamValue uniform (36.0892 0 0);
    }

    sideL
    {
        type            cyclicAMI;
    }

    sideR
    {
        type            cyclicAMI;
    }

    wing
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}
